#+title: Cryptographically Signed License Issuance with Payment in Cryptocurrency
#+date: 2022-01-25 12:32:00
#+draft: false
#+EXPORT_FILE_NAME: README.pdf
#+STARTUP: org-startup-with-inline-images inlineimages
#+STARTUP: org-latex-tables-centered nil
#+OPTIONS: ^:nil # Disable sub/superscripting with bare _; _{...} still works
#+OPTIONS: toc:nil

#+BEGIN_SRC emacs-lisp :noweb no-export :exports results
;; Tables not centered
(
 setq org-latex-tables-centered nil
      org-src-preserve-indentation t
      org-edit-src-content-indentation 0
)
nil
#+END_SRC

#+RESULTS:

#+BEGIN_ABSTRACT
Licensing software and getting paid for it has become extremely difficult, due to government,
regulatory and banking interference.

The =crypto-licensing= Python module allows you automatically and securely issue licenses, and get
paid in various cryptocurrencies.
#+END_ABSTRACT
#+TOC: headlines 2

* Confirmation using Ed25519 Signatures

** Creating an Authoring Keypair

   To begin authoring Licenses, you need to be able to sign them.  Create and save an encrypted
   Ed25519 keypair.

   #+LATEX: {\scriptsize
   #+BEGIN_SRC ipython :session :exports both :results raw drawer
     import crypto_licensing as cl
     username		= 'admin@awesome-inc.com'
     password		= 'password'
     encr_keypair	= cl.KeypairEncrypted( username=username, password=password )
     decr_keypair	= cl.KeypairPlaintext( encr_keypair.into_keypair( username=username, password=password ))
     [
	 [ "salt", encr_keypair['salt'] ],
	 [ "ciphertext", encr_keypair['ciphertext'] ],
	 [ "verifying key", decr_keypair['vk'] ],
	 [ "signing key", decr_keypair['sk'] ],
     ]
   #+END_SRC

   #+RESULTS:
   :results:
   # Out[2]:
   | 0             | 1                                                                                                |
   |---------------+--------------------------------------------------------------------------------------------------|
   | salt          | 02b7c9fae7c4ed836d253c51                                                                         |
   | ciphertext    | 4a14806f492fc1d42de87104aee5a451dc7fba8a966f47de683c373e9f5bf2d123af54f954306c0b2bac881033ca7e0e |
   | verifying key | 6Mc+SPr5DOLm1dNal8WtpewEmjqJLpQg/favvJDIbFc=                                                     |
   | signing key   | yhzTgZ83q2yRJ8+7quHIvVGYX5AaOhpjP7HsjO8GOiroxz5I+vkM4ubV01qXxa2l7ASaOokulCD99q+8kMhsVw==         |
   :end:

   #+LATEX: }

* Payment with Cryptocurrencies
* Issuance via Web API
